/**********************************************

			静态数码管实验
 		
		控制数码管依次显示0-9
	P1连接8位数码管左侧排针U11_JP1

***********************************************/

#include <reg52.h>

#define uchar unsigned char

uchar code table[] = {0x3F, 0x06, 0x5B, 0x4F, 0x66, 0x6D, 0x7D, 0x07, 0x7F, 0x6F, 0x77, 0x7C, 0x39, 0x5E, 0x79, 0x71};

/**********************************************

				延时函数

***********************************************/
void delay()
{
	int i, j;
	for(i = 0; i < 200; i++)
	{
		for(j = 0; j < 110; j++) ;
	}
}

/**********************************************

			   主函数

***********************************************/

void main()
{
	uchar NumVal = 0;
	while(1)
	{
		for(NumVal = 0; NumVal < 8; NumVal++)	//循环
		{
			P1 = table[NumVal];					//将数值赋给P1，控制数码管
			delay();							//延时
		}
	}
}



